IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/C2000/f280015x_analog_subsys_regs.xml
<module id="ANALOG_SUBSYS_REGS" HW_revision="" description="ANALOG SUBSYS Registers">
	<register id="EXTROSCCSR1" width="32" page="1" offset="0x24" internal="0" description="External R based Oscillator Control and Status Register">
		<bitfield id="CFG_56_55_SWOVR_DIVPROG" description="CFG_COUNTER_DIV" begin="8" end="7" width="2" rwaccess="RW"/>
		<bitfield id="CFG_59_57_SWOVR_DELPROG" description="COUNTER DELAY config" begin="11" end="9" width="3" rwaccess="RW"/>
		<bitfield id="OSCSTATUS" description="Observing EXTR signals" begin="31" end="24" width="8" rwaccess="R"/>
	</register>
	<register id="CONFIGLOCK" width="32" page="1" offset="0x5e" internal="0" description="Lock Register for all the config registers.">
		<bitfield id="AGPIOCTRL" description="Locks all AGPIOCTRL Register" begin="3" end="3" width="1" rwaccess="RW"/>
	</register>
	<register id="TSNSCTL" width="16" page="1" offset="0x60" internal="0" description="Temperature Sensor Control Register">
		<bitfield id="ENABLE" description="Temperature Sensor Enable" begin="0" end="0" width="1" rwaccess="RW"/>
	</register>
	<register id="ANAREFCTL" width="16" page="1" offset="0x68" internal="0" description="Analog Reference Control Register. This register is not configurable for 32QFN package">
		<bitfield id="ANAREFSEL" description="Analog Reference Select" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="ANAREF2P5SEL" description="Analog Reference Select" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="ANAREFSEL_SUP_OVERRIDE" description="Control for overriding the analog reference with VDDA/VSSA" begin="15" end="15" width="1" rwaccess="RW"/>
	</register>
	<register id="VMONCTL" width="16" page="1" offset="0x70" internal="0" description="Voltage Monitor Control Register">
		<bitfield id="BORLVMONDIS" description="Disable BORL(ow) feature on VDDIO" begin="8" end="8" width="1" rwaccess="RW"/>
	</register>
	<register id="CMPHPMXSEL" width="32" page="1" offset="0x82" internal="0" description="Bits to select one of the many sources on CompHP inputs. Refer to Pimux diagram for details.">
		<bitfield id="CMP1HPMXSEL" description="CMP1HPMXSEL bits" begin="2" end="0" width="3" rwaccess="RW"/>
		<bitfield id="CMP2HPMXSEL" description="CMP2HPMXSEL bits" begin="5" end="3" width="3" rwaccess="RW"/>
		<bitfield id="CMP3HPMXSEL" description="CMP3HPMXSEL bits" begin="8" end="6" width="3" rwaccess="RW"/>
		<bitfield id="CMP4HPMXSEL" description="CMP4HPMXSEL bits" begin="11" end="9" width="3" rwaccess="RW"/>
	</register>
	<register id="CMPLPMXSEL" width="32" page="1" offset="0x84" internal="0" description="Bits to select one of the many sources on CompLP inputs. Refer to Pimux diagram for details.">
		<bitfield id="CMP1LPMXSEL" description="CMP1LPMXSEL bits" begin="2" end="0" width="3" rwaccess="RW"/>
		<bitfield id="CMP2LPMXSEL" description="CMP2LPMXSEL bits" begin="5" end="3" width="3" rwaccess="RW"/>
		<bitfield id="CMP3LPMXSEL" description="CMP3LPMXSEL bits" begin="8" end="6" width="3" rwaccess="RW"/>
		<bitfield id="CMP4LPMXSEL" description="CMP4LPMXSEL bits" begin="11" end="9" width="3" rwaccess="RW"/>
	</register>
	<register id="CMPHNMXSEL" width="16" page="1" offset="0x86" internal="0" description="Bits to select one of the many sources on CompHN inputs. Refer to Pimux diagram for details.">
		<bitfield id="CMP1HNMXSEL" description="CMP1HNMXSEL bits" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="CMP2HNMXSEL" description="CMP2HNMXSEL bits" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="CMP3HNMXSEL" description="CMP3HNMXSEL bits" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="CMP4HNMXSEL" description="CMP4HNMXSEL bits" begin="3" end="3" width="1" rwaccess="RW"/>
	</register>
	<register id="CMPLNMXSEL" width="16" page="1" offset="0x87" internal="0" description="Bits to select one of the many sources on CompLN inputs. Refer to Pimux diagram for details.">
		<bitfield id="CMP1LNMXSEL" description="CMP1LNMXSEL bits" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="CMP2LNMXSEL" description="CMP2LNMXSEL bits" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="CMP3LNMXSEL" description="CMP3LNMXSEL bits" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="CMP4LNMXSEL" description="CMP4LNMXSEL bits" begin="3" end="3" width="1" rwaccess="RW"/>
	</register>
	<register id="ADCDACLOOPBACK" width="32" page="1" offset="0x88" internal="0" description="Enabble loopback from DAC to ADCs">
		<bitfield id="ENLB2ADCA" description="Enable DACA loopback to ADCA" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="ENLB2ADCC" description="Enable DACA loopback to ADCC" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="KEY" description="Key to enable writes" begin="31" end="16" width="16" rwaccess="RW"/>
	</register>
	<register id="CMPSSCTL" width="16" page="1" offset="0x8b" internal="0" description="CMPSS Control Register">
		<bitfield id="CMP1LDACOUTEN" description="Enable general purpose DAC functionality for CMPSS1.COMPDACL" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="CMPSSCTLEN" description="Enable the CMPSSCTL Register" begin="15" end="15" width="1" rwaccess="RW"/>
	</register>
	<register id="LOCK" width="32" page="1" offset="0x8e" internal="0" description="Lock Register">
		<bitfield id="TSNSCTL" description="TSNSCTL Register lock bit" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="ANAREFCTL" description="ANAREFCTL Register lock bit" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="VMONCTL" description="VMONCTL Register lock bit" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="CMPHPMXSEL" description="CMPHPMXSEL Register lock bit" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="CMPLPMXSEL" description="CMPLPMXSEL Register lock bit" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="CMPHNMXSEL" description="CMPHNMXSEL Register lock bit" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="CMPLNMXSEL" description="CMPLNMXSEL Register lock bit" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="VREGCTL" description="VREGCTL Register lock bit" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="CMPSSCTL" description="CMPSSCTL Register lock bit" begin="10" end="10" width="1" rwaccess="RW"/>
	</register>
	<register id="AGPIOCTRLA" width="32" page="1" offset="0x10a" internal="0" description="AGPIO Control Register">
		<bitfield id="GPIO12" description="AGPIOCTRL for GPIO12" begin="12" end="12" width="1" rwaccess="RW"/>
		<bitfield id="GPIO13" description="AGPIOCTRL for GPIO13" begin="13" end="13" width="1" rwaccess="RW"/>
		<bitfield id="GPIO20" description="AGPIOCTRL for GPIO20" begin="20" end="20" width="1" rwaccess="RW"/>
		<bitfield id="GPIO21" description="AGPIOCTRL for GPIO21" begin="21" end="21" width="1" rwaccess="RW"/>
		<bitfield id="GPIO28" description="AGPIOCTRL for GPIO28" begin="28" end="28" width="1" rwaccess="RW"/>
	</register>
	<register id="AGPIOCTRLH" width="32" page="1" offset="0x118" internal="0" description="AGPIO Control Register">
		<bitfield id="GPIO224" description="AGPIOCTRL for GPIO224" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="GPIO226" description="AGPIOCTRL for GPIO226" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="GPIO227" description="AGPIOCTRL for GPIO227" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="GPIO228" description="AGPIOCTRL for GPIO228" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="GPIO230" description="AGPIOCTRL for GPIO230" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="GPIO242" description="AGPIOCTRL for GPIO242" begin="18" end="18" width="1" rwaccess="RW"/>
	</register>
</module>
